<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/590b0a3c-b71a-4485-89bd-7ebf036cfab7/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/walletconnect-prod-history/walletconnect-prod-history-service"
        name                               = "walletconnect-prod-history-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/walletconnect-prod-history:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/walletconnect-prod-history:3" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "walletconnect-prod-history" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.monitoring.data.jsonnet_file.dashboard will be read during apply
  # (config refers to values not yet known)
 <= data "jsonnet_file" "dashboard" {
      + ext_str  = {
          + "name"  = "history"
          + "stage" = "prod"
        }
      + id       = (known after apply)
      + rendered = (known after apply)
      + source   = "monitoring/dashboard.jsonnet"
    }

  # module.monitoring.grafana_dashboard.at_a_glance will be created
  + resource "grafana_dashboard" "at_a_glance" {
      + config_json  = (known after apply)
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + message      = "Updated by Terraform"
      + overwrite    = true
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.monitoring.grafana_data_source.cloudwatch will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "walletconnect-eu-central-1-prod-history-cloudwatch"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.monitoring.grafana_data_source.prometheus will be created
  + resource "grafana_data_source" "prometheus" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + httpMethod    = "GET"
              + manageAlerts  = false
              + sigV4Auth     = true
              + sigV4AuthType = "ec2_iam_role"
              + sigV4Region   = "eu-central-1"
            }
        )
      + name               = "walletconnect-eu-central-1-prod-history-amp"
      + type               = "prometheus"
      + uid                = (known after apply)
      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/"
    }

  # module.o11y.grafana_dashboard.at_a_glance will be destroyed
  # (because grafana_dashboard.at_a_glance is not in configuration)
  - resource "grafana_dashboard" "at_a_glance" {
      - config_json  = jsonencode(
            {
              - annotations          = {
                  - list = [
                      - {
                          - builtIn    = 1
                          - datasource = "-- Grafana --"
                          - enable     = true
                          - hide       = true
                          - iconColor  = "rgba(0, 211, 255, 1)"
                          - name       = "Annotations & Alerts"
                          - target     = {
                              - limit    = 100
                              - matchAny = false
                              - tags     = []
                              - type     = "dashboard"
                            }
                          - type       = "dashboard"
                        },
                    ]
                }
              - editable             = true
              - fiscalYearStartMonth = 0
              - graphTooltip         = 0
              - links                = []
              - liveNow              = false
              - panels               = [
                  - {
                      - datasource    = {
                          - type = "prometheus"
                          - uid  = "uL5HCbTVz"
                        }
                      - description   = "The number of items received from relay"
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "thresholds"
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 10
                          - x = 0
                          - y = 0
                        }
                      - options       = {
                          - colorMode     = "value"
                          - graphMode     = "area"
                          - justifyMode   = "auto"
                          - orientation   = "auto"
                          - reduceOptions = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - text          = {}
                          - textMode      = "auto"
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - datasource   = {
                                  - type = "prometheus"
                                  - uid  = "uL5HCbTVz"
                                }
                              - exemplar     = true
                              - expr         = "sum(rate(received_items{}[1h]))"
                              - interval     = ""
                              - legendFormat = ""
                              - refId        = "A"
                            },
                        ]
                      - title         = "Received Items per Hour"
                      - type          = "stat"
                    },
                  - {
                      - datasource    = {
                          - type = "prometheus"
                          - uid  = "uL5HCbTVz"
                        }
                      - description   = "The number of items actually stored in the database"
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "thresholds"
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 10
                          - x = 10
                          - y = 0
                        }
                      - options       = {
                          - colorMode     = "value"
                          - graphMode     = "area"
                          - justifyMode   = "auto"
                          - orientation   = "auto"
                          - reduceOptions = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - text          = {}
                          - textMode      = "auto"
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - datasource   = {
                                  - type = "prometheus"
                                  - uid  = "uL5HCbTVz"
                                }
                              - exemplar     = true
                              - expr         = "sum(rate(stored_items{}[1h]))"
                              - interval     = ""
                              - legendFormat = ""
                              - refId        = "A"
                            },
                        ]
                      - title         = "Stored Items per Hour"
                      - type          = "stat"
                    },
                  - {
                      - datasource    = {
                          - type = "prometheus"
                          - uid  = "uL5HCbTVz"
                        }
                      - description   = "The number of items retrieval queries"
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "thresholds"
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 10
                          - x = 0
                          - y = 8
                        }
                      - options       = {
                          - colorMode     = "value"
                          - graphMode     = "area"
                          - justifyMode   = "auto"
                          - orientation   = "auto"
                          - reduceOptions = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - text          = {}
                          - textMode      = "auto"
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - datasource   = {
                                  - type = "prometheus"
                                  - uid  = "uL5HCbTVz"
                                }
                              - exemplar     = true
                              - expr         = "sum(rate(get_queries{}[1h]))"
                              - interval     = ""
                              - legendFormat = ""
                              - refId        = "A"
                            },
                        ]
                      - title         = "Get Queries per Hour"
                      - type          = "stat"
                    },
                  - {
                      - datasource    = {
                          - type = "prometheus"
                          - uid  = "uL5HCbTVz"
                        }
                      - description   = "The number of messages served to clients"
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "thresholds"
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 10
                          - x = 10
                          - y = 8
                        }
                      - options       = {
                          - colorMode     = "value"
                          - graphMode     = "area"
                          - justifyMode   = "auto"
                          - orientation   = "auto"
                          - reduceOptions = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - text          = {}
                          - textMode      = "auto"
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - datasource   = {
                                  - type = "prometheus"
                                  - uid  = "uL5HCbTVz"
                                }
                              - exemplar     = true
                              - expr         = "sum(rate(served_items{}[1h]))"
                              - interval     = ""
                              - legendFormat = ""
                              - refId        = "A"
                            },
                        ]
                      - title         = "Served Items per Hour"
                      - type          = "stat"
                    },
                  - {
                      - datasource    = {
                          - type = "prometheus"
                          - uid  = "uL5HCbTVz"
                        }
                      - description   = "The number of registrations retrieved from the in-memory cache"
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "thresholds"
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 16
                          - w = 10
                          - x = 0
                          - y = 8
                        }
                      - options       = {
                          - colorMode     = "value"
                          - graphMode     = "area"
                          - justifyMode   = "auto"
                          - orientation   = "auto"
                          - reduceOptions = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - text          = {}
                          - textMode      = "auto"
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - datasource   = {
                                  - type = "prometheus"
                                  - uid  = "uL5HCbTVz"
                                }
                              - exemplar     = true
                              - expr         = "sum(rate(cached_registrations{}[1h]))"
                              - interval     = ""
                              - legendFormat = ""
                              - refId        = "A"
                            },
                        ]
                      - title         = "Cached Registrations per Hour"
                      - type          = "stat"
                    },
                  - {
                      - datasource    = {
                          - type = "prometheus"
                          - uid  = "uL5HCbTVz"
                        }
                      - description   = "The number of registrations retrieved from the database"
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "thresholds"
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 16
                          - w = 10
                          - x = 10
                          - y = 8
                        }
                      - options       = {
                          - colorMode     = "value"
                          - graphMode     = "area"
                          - justifyMode   = "auto"
                          - orientation   = "auto"
                          - reduceOptions = {
                              - calcs  = [
                                  - "lastNotNull",
                                ]
                              - fields = ""
                              - values = false
                            }
                          - text          = {}
                          - textMode      = "auto"
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - datasource   = {
                                  - type = "prometheus"
                                  - uid  = "uL5HCbTVz"
                                }
                              - exemplar     = true
                              - expr         = "sum(rate(fetched_registrations{}[1h]))"
                              - interval     = ""
                              - legendFormat = ""
                              - refId        = "A"
                            },
                        ]
                      - title         = "Fetched Registrations Items per Hour"
                      - type          = "stat"
                    },
                ]
              - schemaVersion        = 1
              - style                = "dark"
              - tags                 = []
              - templating           = {
                  - list = []
                }
              - time                 = {
                  - from = "now-6h"
                  - to   = "now"
                }
              - timepicker           = {}
              - timezone             = ""
              - title                = "walletconnect-prod-prod-history"
              - uid                  = "walletconnect-prod-prod-history"
              - weekStart            = ""
            }
        ) -> null
      - dashboard_id = 43 -> null
      - id           = "0:walletconnect-prod-prod-history" -> null
      - message      = "Updated by Terraform" -> null
      - overwrite    = true -> null
      - slug         = "walletconnect-prod-prod-history" -> null
      - uid          = "walletconnect-prod-prod-history" -> null
      - url          = "https://g-49ef0030d2.grafana-workspace.eu-central-1.amazonaws.com/d/walletconnect-prod-prod-history/walletconnect-prod-prod-history" -> null
      - version      = 2 -> null
    }

  # module.o11y.grafana_data_source.cloudwatch will be destroyed
  # (because grafana_data_source.cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "81" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - defaultRegion = "prod"
            }
        ) -> null
      - name               = "walletconnect-prod-prod-history-cloudwatch" -> null
      - type               = "cloudwatch" -> null
      - uid                = "thOHjbT4z" -> null
    }

  # module.o11y.grafana_data_source.prometheus will be destroyed
  # (because grafana_data_source.prometheus is not in configuration)
  - resource "grafana_data_source" "prometheus" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "82" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - httpMethod    = "GET"
              - manageAlerts  = false
              - sigV4Auth     = true
              - sigV4AuthType = "ec2_iam_role"
              - sigV4Region   = "prod"
            }
        ) -> null
      - name               = "walletconnect-prod-prod-history-amp" -> null
      - type               = "prometheus" -> null
      - uid                = "uL5HCbTVz" -> null
      - url                = "https://aps-workspaces.prod.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/" -> null
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ version = "0.7.7" -> "0.8.0"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/walletconnect-prod-history/walletconnect-prod-history-service"%0A        name                               = "walletconnect-prod-history-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/walletconnect-prod-history:3" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/walletconnect-prod-history:3" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "walletconnect-prod-history" -> (known after apply)%0A      ~ revision                 = 3 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.monitoring.data.jsonnet_file.dashboard will be read during apply%0A  # (config refers to values not yet known)%0A <= data "jsonnet_file" "dashboard" {%0A      + ext_str  = {%0A          + "name"  = "history"%0A          + "stage" = "prod"%0A        }%0A      + id       = (known after apply)%0A      + rendered = (known after apply)%0A      + source   = "monitoring/dashboard.jsonnet"%0A    }%0A%0A  # module.monitoring.grafana_dashboard.at_a_glance will be created%0A  + resource "grafana_dashboard" "at_a_glance" {%0A      + config_json  = (known after apply)%0A      + dashboard_id = (known after apply)%0A      + id           = (known after apply)%0A      + message      = "Updated by Terraform"%0A      + overwrite    = true%0A      + slug         = (known after apply)%0A      + uid          = (known after apply)%0A      + url          = (known after apply)%0A      + version      = (known after apply)%0A    }%0A%0A  # module.monitoring.grafana_data_source.cloudwatch will be created%0A  + resource "grafana_data_source" "cloudwatch" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + defaultRegion = "eu-central-1"%0A            }%0A        )%0A      + name               = "walletconnect-eu-central-1-prod-history-cloudwatch"%0A      + type               = "cloudwatch"%0A      + uid                = (known after apply)%0A    }%0A%0A  # module.monitoring.grafana_data_source.prometheus will be created%0A  + resource "grafana_data_source" "prometheus" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + httpMethod    = "GET"%0A              + manageAlerts  = false%0A              + sigV4Auth     = true%0A              + sigV4AuthType = "ec2_iam_role"%0A              + sigV4Region   = "eu-central-1"%0A            }%0A        )%0A      + name               = "walletconnect-eu-central-1-prod-history-amp"%0A      + type               = "prometheus"%0A      + uid                = (known after apply)%0A      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/"%0A    }%0A%0A  # module.o11y.grafana_dashboard.at_a_glance will be destroyed%0A  # (because grafana_dashboard.at_a_glance is not in configuration)%0A  - resource "grafana_dashboard" "at_a_glance" {%0A      - config_json  = jsonencode(%0A            {%0A              - annotations          = {%0A                  - list = [%0A                      - {%0A                          - builtIn    = 1%0A                          - datasource = "-- Grafana --"%0A                          - enable     = true%0A                          - hide       = true%0A                          - iconColor  = "rgba(0, 211, 255, 1)"%0A                          - name       = "Annotations & Alerts"%0A                          - target     = {%0A                              - limit    = 100%0A                              - matchAny = false%0A                              - tags     = []%0A                              - type     = "dashboard"%0A                            }%0A                          - type       = "dashboard"%0A                        },%0A                    ]%0A                }%0A              - editable             = true%0A              - fiscalYearStartMonth = 0%0A              - graphTooltip         = 0%0A              - links                = []%0A              - liveNow              = false%0A              - panels               = [%0A                  - {%0A                      - datasource    = {%0A                          - type = "prometheus"%0A                          - uid  = "uL5HCbTVz"%0A                        }%0A                      - description   = "The number of items received from relay"%0A                      - fieldConfig   = {%0A                          - defaults  = {%0A                              - color      = {%0A                                  - mode = "thresholds"%0A                                }%0A                              - mappings   = []%0A                              - thresholds = {%0A                                  - mode  = "absolute"%0A                                  - steps = [%0A                                      - {%0A                                          - color = "green"%0A                                          - value = null%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                          - overrides = []%0A                        }%0A                      - gridPos       = {%0A                          - h = 8%0A                          - w = 10%0A                          - x = 0%0A                          - y = 0%0A                        }%0A                      - options       = {%0A                          - colorMode     = "value"%0A                          - graphMode     = "area"%0A                          - justifyMode   = "auto"%0A                          - orientation   = "auto"%0A                          - reduceOptions = {%0A                              - calcs  = [%0A                                  - "lastNotNull",%0A                                ]%0A                              - fields = ""%0A                              - values = false%0A                            }%0A                          - text          = {}%0A                          - textMode      = "auto"%0A                        }%0A                      - pluginVersion = "8.4.7"%0A                      - targets       = [%0A                          - {%0A                              - datasource   = {%0A                                  - type = "prometheus"%0A                                  - uid  = "uL5HCbTVz"%0A                                }%0A                              - exemplar     = true%0A                              - expr         = "sum(rate(received_items{}[1h]))"%0A                              - interval     = ""%0A                              - legendFormat = ""%0A                              - refId        = "A"%0A                            },%0A                        ]%0A                      - title         = "Received Items per Hour"%0A                      - type          = "stat"%0A                    },%0A                  - {%0A                      - datasource    = {%0A                          - type = "prometheus"%0A                          - uid  = "uL5HCbTVz"%0A                        }%0A                      - description   = "The number of items actually stored in the database"%0A                      - fieldConfig   = {%0A                          - defaults  = {%0A                              - color      = {%0A                                  - mode = "thresholds"%0A                                }%0A                              - mappings   = []%0A                              - thresholds = {%0A                                  - mode  = "absolute"%0A                                  - steps = [%0A                                      - {%0A                                          - color = "green"%0A                                          - value = null%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                          - overrides = []%0A                        }%0A                      - gridPos       = {%0A                          - h = 8%0A                          - w = 10%0A                          - x = 10%0A                          - y = 0%0A                        }%0A                      - options       = {%0A                          - colorMode     = "value"%0A                          - graphMode     = "area"%0A                          - justifyMode   = "auto"%0A                          - orientation   = "auto"%0A                          - reduceOptions = {%0A                              - calcs  = [%0A                                  - "lastNotNull",%0A                                ]%0A                              - fields = ""%0A                              - values = false%0A                            }%0A                          - text          = {}%0A                          - textMode      = "auto"%0A                        }%0A                      - pluginVersion = "8.4.7"%0A                      - targets       = [%0A                          - {%0A                              - datasource   = {%0A                                  - type = "prometheus"%0A                                  - uid  = "uL5HCbTVz"%0A                                }%0A                              - exemplar     = true%0A                              - expr         = "sum(rate(stored_items{}[1h]))"%0A                              - interval     = ""%0A                              - legendFormat = ""%0A                              - refId        = "A"%0A                            },%0A                        ]%0A                      - title         = "Stored Items per Hour"%0A                      - type          = "stat"%0A                    },%0A                  - {%0A                      - datasource    = {%0A                          - type = "prometheus"%0A                          - uid  = "uL5HCbTVz"%0A                        }%0A                      - description   = "The number of items retrieval queries"%0A                      - fieldConfig   = {%0A                          - defaults  = {%0A                              - color      = {%0A                                  - mode = "thresholds"%0A                                }%0A                              - mappings   = []%0A                              - thresholds = {%0A                                  - mode  = "absolute"%0A                                  - steps = [%0A                                      - {%0A                                          - color = "green"%0A                                          - value = null%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                          - overrides = []%0A                        }%0A                      - gridPos       = {%0A                          - h = 8%0A                          - w = 10%0A                          - x = 0%0A                          - y = 8%0A                        }%0A                      - options       = {%0A                          - colorMode     = "value"%0A                          - graphMode     = "area"%0A                          - justifyMode   = "auto"%0A                          - orientation   = "auto"%0A                          - reduceOptions = {%0A                              - calcs  = [%0A                                  - "lastNotNull",%0A                                ]%0A                              - fields = ""%0A                              - values = false%0A                            }%0A                          - text          = {}%0A                          - textMode      = "auto"%0A                        }%0A                      - pluginVersion = "8.4.7"%0A                      - targets       = [%0A                          - {%0A                              - datasource   = {%0A                                  - type = "prometheus"%0A                                  - uid  = "uL5HCbTVz"%0A                                }%0A                              - exemplar     = true%0A                              - expr         = "sum(rate(get_queries{}[1h]))"%0A                              - interval     = ""%0A                              - legendFormat = ""%0A                              - refId        = "A"%0A                            },%0A                        ]%0A                      - title         = "Get Queries per Hour"%0A                      - type          = "stat"%0A                    },%0A                  - {%0A                      - datasource    = {%0A                          - type = "prometheus"%0A                          - uid  = "uL5HCbTVz"%0A                        }%0A                      - description   = "The number of messages served to clients"%0A                      - fieldConfig   = {%0A                          - defaults  = {%0A                              - color      = {%0A                                  - mode = "thresholds"%0A                                }%0A                              - mappings   = []%0A                              - thresholds = {%0A                                  - mode  = "absolute"%0A                                  - steps = [%0A                                      - {%0A                                          - color = "green"%0A                                          - value = null%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                          - overrides = []%0A                        }%0A                      - gridPos       = {%0A                          - h = 8%0A                          - w = 10%0A                          - x = 10%0A                          - y = 8%0A                        }%0A                      - options       = {%0A                          - colorMode     = "value"%0A                          - graphMode     = "area"%0A                          - justifyMode   = "auto"%0A                          - orientation   = "auto"%0A                          - reduceOptions = {%0A                              - calcs  = [%0A                                  - "lastNotNull",%0A                                ]%0A                              - fields = ""%0A                              - values = false%0A                            }%0A                          - text          = {}%0A                          - textMode      = "auto"%0A                        }%0A                      - pluginVersion = "8.4.7"%0A                      - targets       = [%0A                          - {%0A                              - datasource   = {%0A                                  - type = "prometheus"%0A                                  - uid  = "uL5HCbTVz"%0A                                }%0A                              - exemplar     = true%0A                              - expr         = "sum(rate(served_items{}[1h]))"%0A                              - interval     = ""%0A                              - legendFormat = ""%0A                              - refId        = "A"%0A                            },%0A                        ]%0A                      - title         = "Served Items per Hour"%0A                      - type          = "stat"%0A                    },%0A                  - {%0A                      - datasource    = {%0A                          - type = "prometheus"%0A                          - uid  = "uL5HCbTVz"%0A                        }%0A                      - description   = "The number of registrations retrieved from the in-memory cache"%0A                      - fieldConfig   = {%0A                          - defaults  = {%0A                              - color      = {%0A                                  - mode = "thresholds"%0A                                }%0A                              - mappings   = []%0A                              - thresholds = {%0A                                  - mode  = "absolute"%0A                                  - steps = [%0A                                      - {%0A                                          - color = "green"%0A                                          - value = null%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                          - overrides = []%0A                        }%0A                      - gridPos       = {%0A                          - h = 16%0A                          - w = 10%0A                          - x = 0%0A                          - y = 8%0A                        }%0A                      - options       = {%0A                          - colorMode     = "value"%0A                          - graphMode     = "area"%0A                          - justifyMode   = "auto"%0A                          - orientation   = "auto"%0A                          - reduceOptions = {%0A                              - calcs  = [%0A                                  - "lastNotNull",%0A                                ]%0A                              - fields = ""%0A                              - values = false%0A                            }%0A                          - text          = {}%0A                          - textMode      = "auto"%0A                        }%0A                      - pluginVersion = "8.4.7"%0A                      - targets       = [%0A                          - {%0A                              - datasource   = {%0A                                  - type = "prometheus"%0A                                  - uid  = "uL5HCbTVz"%0A                                }%0A                              - exemplar     = true%0A                              - expr         = "sum(rate(cached_registrations{}[1h]))"%0A                              - interval     = ""%0A                              - legendFormat = ""%0A                              - refId        = "A"%0A                            },%0A                        ]%0A                      - title         = "Cached Registrations per Hour"%0A                      - type          = "stat"%0A                    },%0A                  - {%0A                      - datasource    = {%0A                          - type = "prometheus"%0A                          - uid  = "uL5HCbTVz"%0A                        }%0A                      - description   = "The number of registrations retrieved from the database"%0A                      - fieldConfig   = {%0A                          - defaults  = {%0A                              - color      = {%0A                                  - mode = "thresholds"%0A                                }%0A                              - mappings   = []%0A                              - thresholds = {%0A                                  - mode  = "absolute"%0A                                  - steps = [%0A                                      - {%0A                                          - color = "green"%0A                                          - value = null%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                          - overrides = []%0A                        }%0A                      - gridPos       = {%0A                          - h = 16%0A                          - w = 10%0A                          - x = 10%0A                          - y = 8%0A                        }%0A                      - options       = {%0A                          - colorMode     = "value"%0A                          - graphMode     = "area"%0A                          - justifyMode   = "auto"%0A                          - orientation   = "auto"%0A                          - reduceOptions = {%0A                              - calcs  = [%0A                                  - "lastNotNull",%0A                                ]%0A                              - fields = ""%0A                              - values = false%0A                            }%0A                          - text          = {}%0A                          - textMode      = "auto"%0A                        }%0A                      - pluginVersion = "8.4.7"%0A                      - targets       = [%0A                          - {%0A                              - datasource   = {%0A                                  - type = "prometheus"%0A                                  - uid  = "uL5HCbTVz"%0A                                }%0A                              - exemplar     = true%0A                              - expr         = "sum(rate(fetched_registrations{}[1h]))"%0A                              - interval     = ""%0A                              - legendFormat = ""%0A                              - refId        = "A"%0A                            },%0A                        ]%0A                      - title         = "Fetched Registrations Items per Hour"%0A                      - type          = "stat"%0A                    },%0A                ]%0A              - schemaVersion        = 1%0A              - style                = "dark"%0A              - tags                 = []%0A              - templating           = {%0A                  - list = []%0A                }%0A              - time                 = {%0A                  - from = "now-6h"%0A                  - to   = "now"%0A                }%0A              - timepicker           = {}%0A              - timezone             = ""%0A              - title                = "walletconnect-prod-prod-history"%0A              - uid                  = "walletconnect-prod-prod-history"%0A              - weekStart            = ""%0A            }%0A        ) -> null%0A      - dashboard_id = 43 -> null%0A      - id           = "0:walletconnect-prod-prod-history" -> null%0A      - message      = "Updated by Terraform" -> null%0A      - overwrite    = true -> null%0A      - slug         = "walletconnect-prod-prod-history" -> null%0A      - uid          = "walletconnect-prod-prod-history" -> null%0A      - url          = "https://g-49ef0030d2.grafana-workspace.eu-central-1.amazonaws.com/d/walletconnect-prod-prod-history/walletconnect-prod-prod-history" -> null%0A      - version      = 2 -> null%0A    }%0A%0A  # module.o11y.grafana_data_source.cloudwatch will be destroyed%0A  # (because grafana_data_source.cloudwatch is not in configuration)%0A  - resource "grafana_data_source" "cloudwatch" {%0A      - access_mode        = "proxy" -> null%0A      - basic_auth_enabled = false -> null%0A      - id                 = "81" -> null%0A      - is_default         = false -> null%0A      - json_data_encoded  = jsonencode(%0A            {%0A              - defaultRegion = "prod"%0A            }%0A        ) -> null%0A      - name               = "walletconnect-prod-prod-history-cloudwatch" -> null%0A      - type               = "cloudwatch" -> null%0A      - uid                = "thOHjbT4z" -> null%0A    }%0A%0A  # module.o11y.grafana_data_source.prometheus will be destroyed%0A  # (because grafana_data_source.prometheus is not in configuration)%0A  - resource "grafana_data_source" "prometheus" {%0A      - access_mode        = "proxy" -> null%0A      - basic_auth_enabled = false -> null%0A      - id                 = "82" -> null%0A      - is_default         = false -> null%0A      - json_data_encoded  = jsonencode(%0A            {%0A              - httpMethod    = "GET"%0A              - manageAlerts  = false%0A              - sigV4Auth     = true%0A              - sigV4AuthType = "ec2_iam_role"%0A              - sigV4Region   = "prod"%0A            }%0A        ) -> null%0A      - name               = "walletconnect-prod-prod-history-amp" -> null%0A      - type               = "prometheus" -> null%0A      - uid                = "uL5HCbTVz" -> null%0A      - url                = "https://aps-workspaces.prod.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/" -> null%0A    }%0A%0APlan: 4 to add, 1 to change, 4 to destroy.%0A%0AChanges to Outputs:%0A  ~ version = "0.7.7" -> "0.8.0"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*